package pmain;

public class J09_Quiz_HW {
	public static void main(String[] args) {
	
//		문제 : 상품 판매 프로그램
		
//		1. 메뉴 항목
//			1. 로그인
//			2. 회원가입
//			3. 프로그램 종료
		
//		2. 관리자 로그인 시 메뉴 항목
//			1. 회원 정보 전체 보기
//			2. 상품 정보 전체 보기
//			3. 재고 소진 상품 정보 보기
//			4. 상의 상품 정보 입력
//			5. 하의 상품 정보 입력
//			6. 총 매출금액 보기
//			7. 프로그램 종료
		
//		3. 회원 로그인 시 메뉴 항목
//			1. 상품 구매
//			2. 구매 목록 보기
//			3. 로그아웃
//			4. 프로그램 종료
		
//		4. 요구 사항
//			1. 회원가입 정보 갯수 : 6명
//			2. 회원가입 정보에는 기본적으로 다음의 관리자 계정이 존재한다.
//				아이디 : system / 비밀번호 : system
//			3. 상의 상품 정보 항목
//				제품고유번호, 제품종류(이름), 생산기업이름, 사이즈(S, M, L, XL),
//				성별, 색상, 재고량, 가격, 계절
//			4. 하의 상품 정보 항목
//				제품고유번호, 제품종류(이름), 생산기업이름, 허리사이즈(38, 39..),
//				성별, 색상, 재고량
//			5. 상의-하의 클래스는 수퍼클래스 설정 후 상속을 통해 구현
//			6. 회원의 상품 주문 요청은 없으며, 구매 시 즉시 관련 사항 처리됨
//			7. 모든 멤버는 private 처리
//			8. 입력 상황에서 발생될 수 있는 모든 예외 상황 고려 및 대비
	}
}
