package pmain;

public class J06_HW {
	public static void main(String[] args) {
		
//		다음 두 프로그램을 FrameWork 를 이용하여 작성하세요.
//		- 단, FrameWork는 각 클래스의 이름이 정해지지 않은 상태에서 작동되어야 한다.
		
		
//		야구 선수 정보 프로그램
		
//		1. 정보 항목
//			1. 회원 정보 : 이름, 아이디, 비밀번호
//			2. 야구 선수 : 이름, 팀이름, 나이, 포지션, 성적(타율/방어율), 연봉
//		2. 정보 관리 개수 : 회원 5개, 야구선수 5개
//		3. 메뉴 항목
//			1. 로그인
//			2. 회원가입
//				1. 야구선수 정보 입력
//					1. 야구선수 정보 입력
//					2. 야수선수 정보 출력
//						1. 전체정보 출력
//						2. 나이순 별 보기
//						3. 검색 결과 보기(이름)
//					3. 로그아웃
//			3. 프로그램 종료
		
//		축구 선수 정보 프로그램

//		1. 정보 항목
//			1. 회원 정보 : 이름, 아이디, 비밀번호, 전화번
//			2. 야구 선수 : 이름, 팀이름, 포지션, 골득점, 연봉, 100m 육상기록
//		2. 정보 관리 개수 : 회원 5개, 축구선수 5개
//		3. 메뉴 항목
//			1. 로그인
//			2. 회원가입
//				1. 야구선수 정보 입력
//					1. 야구선수 정보 입력
//					2. 야수선수 정보 출력
//						1. 전체정보 출력
//						2. 골득점 순 별 보기
//						3. 검색 결과 보기(이름)
//					3. 로그아웃
//			3. 프로그램 종료
	}
}
