package pmain;

public class J04_Quiz_HW_if {
	
//	JOptionPane과 if문을 이용하여 다음 프로그램을 작성하세요.
	
//	1. 정수 1개를 입력받아 다음의 판별 결과를 출력하세요.
//		1. 입력한 값이 3의 배수인지 판별
//		2. 짝수-홀수 판별
	
//	2. 정수 2개를 입력받아 다음의 판별 결과를 출력하세요.
//		1. 큰 수 판별
//		2. 작은 수의 짝수-홀수 판별
//		3. 두 정수의 합이 짝수이고, 3의 배수인지 판별
	
//	3. 정수 3개를 입력받아 다음의 판별 결과를 출력하세요.
//		1. 큰 수 판별
//		2. 큰 수와 작은 수의 차이가 50보다 큰지, 작은지 판별
	
//	4. 다음의 프로그램을 작성하세요.
//		1. 노래방 이용 금액산출 프로그램
//			노래방 이용에 대한 1인당 요금 책정 방법이 다음과 같습니다.
//				- 처음 30분의 기본요금은 1인당 3000원이다.
//				- 이후에는 10분당 500원씩의 추가 요금을 받는다.
//			이용 인원과 이용 시간을 입력했을 때 금액이 산출되는 프로그램을 작성하세요.
	
//		2. 커피 구입 급액산출 프로그램	
//			커피를 주문하는데 구매금액은 다음과 같습니다.
//				- 10개까지는 개당 2500원
//				- 10개를 초과하는 양에 대해서는 개당 2400원
//			커피 구매 갯수를 입력했을 때 금액이 산출되는 프로그램을 작성하세요.
	
//		3. USB 금액산출 프로그램
//			USB 구매 금액은 다음과 같습니다.
//				- 1개에 5000
//				- 한번에 10개 이상을 사면 전체 금액의 10%를 할인
//				- 한번에 100개 이상을 사면 전체 금액의 12%를 할인
//			구매 갯수를 입력했을 때 구매 금액이 산출되는 프로그램을 작성하세요.
	
//		4. 학생 성적 관리 프로그램
//			학생 성적 관리 항목은 다음과 같습니다.
//				- 이름, 국어점수, 영어점수, 수학점수, 총점, 평균, 등(ABCDF)
//				- 각 과목은 정수
//				- 평균은 실수
//				- 평균이 90점 이상인 경우 A, 80점 이상인 경우 B, 70점 이상인 경우 C,
//					60점 이상인 경우 D, 그 밖의 점수 F
//			이름, 국어-영어-수학 점수를 입력했을 때 전체 관리 항목의 결과가 출력되도록
//			프로그램을 작성하세요.
	

}
