package pmain;

public class J04_Quiz_Curr_if {
	public static void main(String[] args) {
		
//		문제 1 :
//			1. 학생의 이름과 나이를 입력받음(JOp)
//			2. 나이에 따른 학교를 출력(JOpt)
//				- 7살 이하면 : 유치원
//				- 8 ~ 13 : 초등학교
//				- 14 ~ 16 : 중학교
//				- 17 ~ 19 : 고등학교
//				- 20 ~ 24 : 대학교
//				- 25 ~ : 직장
		
		
		
//		문제 2 :
//			1. 학생의 이름과 국어, 영어, 수학 점수를 입력받음(JOp)
//				- 각 점수는 정수형
//			2. 학생의 총점과 평균을 산출
//				- 평균은 실수
//			3. 학생의 평균 점수에 따라 다음을 출력(Jop)
//				- 평균이 90점 이상일 때,
//					모든 과목의 점수가 85 이상이면, 최우수학생 && 등급은 A
//					하나의 점수라도 85 미만이면, 우수학생 && 등급은 A
//				- 평균이 80점 이상일 때, 등급은 B
//				- 평균이 70점 이상일 때, 등급은 C
//				- 평균이 60점 이상일 때, 등급은 D
//				- 평균이 60점 미만일 때,
//					하나의 과목이라도 30점 미만이면, 재수강 불가능 && 등급은 F
//					모든 과목의 점수가 30점 이상이면, 재수강 가능 && 등급은 F
					
					
					
//		문제 3 :
//			1. 어린이의 이름, 나이, 키를 입력(Jop)
//				- 나이 : 정수형, 키 : 실수형
//			2. 각 조건에 따라 이용 가능한 놀이 기구를 출(Jop)
//				- 나이가 10살 이상인 경우
//					- 키가 150.5 cm 이상이면 : 자이로드롭, 우주열차 가능
//					- 키가 150.0 cm 미만이면 : 우주열차 가능
//				- 나이가 10살 미만인 경우
//					- 키가 120.5 cm 이상인 경우 : 해저 탐험, 회전목마 가능
//					- 키가 120.5 cm 미만인 경우 : 회전 목마 가능
	}
}
