package pmain;

public class J08_Quiz_Curr_while {
	
//	JOptionPane과 while문 및 기타 제어문을 이용하여 다음의 프로그램을 작성하세요.
	
//	1. 반복 구문 출력 프로그램
//		1. 정수 1개 및 문장을 입력했을 때 다음과 같이 출력되도록 작성하세요.
//		2. 예 :
//			입력 사항 :
//				- 정수 입력 -> 3
//				- 반복 출력하려는 문장 입력 -> Hello Java
//			결과 화면 :
//				1. Hello JAVA
//				2. Hello JAVA
//				3. Hello JAVA
	
//	2. 총 합 산출 프로그램
//		1. 정수 2개를 입력했을 때
//			두 정수 범위 사이에 존재하는 모든 수의 합을 산출하는 프로그램을 작성하세요.
//		2. 예 :
//			입력 사항 :
//				- 첫번째 정수 입력 -> 1
//				- 두번째 정수 입력 -> 10
//			결과 화면 :
//				1 ~ 10의 범위의 모든 정수 합은 55 입니다.
	
//	3. 총 곱 산출 프로그램
//		1. 정수 2개를 입력했을 때
//			두 정수 범위 사이에 존재하는 7의 배수들의 총 곲을 산출하는 프로그램을 작성하세요.
//		2. 예 :
//			입력 사항 :
//				- 첫번째 정수 입력 -> 1
//				- 두번째 정수 입력 -> 20
//			결과 화면 :
//				1 ~ 20의 범위의 7의 배수 총 곱은 98 입니다.
	
//	4. 총 합 및 마지막 수 산출 프로그램
//		1. 정수 2개를 입력했을 때
//			두 정수 범위 사이에 존재하는 6의 배수들의 총 합 및
//			마지막 더해진 수를 출력하는 프로그램을 작성하세요.
//		2. 예 :
//			입력 사항 :
//				- 첫번째 정수 입력 -> 1
//				- 두번째 정수 입력 -> 20
//			결과 화면 :
//				1 ~ 20의 범위의 6의 배수 총 합은 36이고, 마지막 더한 6의 배수는 18입니다.
	

}
