package pmain;

public class J10_Quiz_HW_while {

//	JOptionPane과 while문 및 기타 제어문을 이용하여 다음의 프로그램을 작성하세요.
	
//	5. 학생 정보 관리 프로그램
//		1. 관리 정보 항목
//			- 이름, 국어-영어-수학점수, 총점, 평균, 등급(ABCDF)
//			- 각 과목 점수는 정수
//			- 평균은 실수
//			- 등급은 기존의 기준 형식 적용
//		2. 메뉴 항목
//			1. 학생 정보 입력
//				- 이름, 각 과목점수 입력
//			2. 학생 정보 출력
//				- 전체 항목
//			3. 성적 결과 보기
//				- 평균 80점 이상 && 각 과목 모두 70점 이상이면 합격
//				- 위의 조건 불만족시 불합격
//			4. 프로그램 종료
//		3. 조건
//			1. 정보가 입력되지 않은 상황에서 "메뉴 2번" 실행하는 경우 예외 상황 처리 필요
//			2. 정보가 입력된 상황에서 "메뉴 1번" 실행하는 경우
//				기존 정보 삭제 알림 메시지 및 동의 처리 필요
}
