package pmain;

public class J07_Quiz_Curr {
	public static void main(String[] args) {
		
		
//		문제 :
		
//		1. 1.** ~ 200.**까지의 랜덤 실수를 변수에 저장 및 출력
		
//		2. 1에서 만든 변수의 값을 정수로 형변환 한 후 10으로 나눈 몫 결과를 출력
		
//		3. 1에서 만든 변수의 값을 정수로 형변환 한 후 10으로 나눈 나머지 값 결과를 출력
		
//		4. 1에서 만든 변수의 값을 정수로 형변환 한 후
//			10으로 나눈 나머지 값 결과가 0인지 아닌지를 출력
		
//		5. 1에서 만든 변수의 값을 정수로 형변환 한 후 40을 더해서 새로운 변수에 저장
		
//		6. 5에서 만든 변수의 값이 짝수인지, 홀수인지 출력
		
//		7. 1에서 만든 변수의값을 정수로 형변환한 값과 5에서 만든 변수의 값의 합이	
//			7의 배수인지 아닌지 출력
		
//		8. 5에서 만든 변수의 값이 80이상 ~ 150 미만 범위의 수인지 출력
	}
}
