package pmain;

public class J05_Quiz_HW_EnCapsulation {
	public static void main(String[] args) {
		
//		로그인 프로그램
//		- 회원 가입 및 로그인 처리를 진행하는 프로그램 작성
		
//		1. 회원가입 정보 항목
//			- 이름, 아이디, 비밀번호, 전화번호
//		2. 회원 관리 갯수 : 5개
		
//		3. 메뉴 항목
//			1. 회원가입하기(1개 단위)
//			2. 로그인하기
//			3. 비밀번호 찾기
//			4. 프로그램 종료
		
//		4. 요구사항
//			1. 컨트롤 클래스 및 엔터티 클래스 관계 작성
//			2. 로그인 완료 시 다음의 메뉴가 노출됨
//				1. 내 정보 보기
//				2. 로그아웃
//					-> 로그아웃 시 기존 메뉴항목으로 돌아감
//			3. 비밀번호 찾기 시
//				이름, 아이디, 전화번호가 일치하는 경우 비밀번호 제공
	}
}
