package pmain;

public class J05_Quiz_HW_mainCla {

//	JOptionPane과 클래스를 이용하여 다음 프로그램을 작성하세요.
	
//	학생 정보 관리 프로그램
//		1. 관리 정보 항목
//			- 이름, 국어-영어-수학점수, 총점, 평균, 등급(ABCDF), 등수
//			- 각 과목은 정수
//			- 평균은 실수
//			- 등수는 총점으로 산출
//		2. 관리 정보 갯수
//			- 인원 3명 분량
//		3. 메뉴 항목
//			1. 학생 정보 입력
//				- 1명 단위 입력
//				- 이름 및 각 과목 점수
//			2. 학생 정보 출력
//				- 입력된 학생의 정보만 출력
//				- 관리 정보 항목 모두 출력
//			3. 성적우수자 정보 출력
//				- 등수가 1딩인 학생의 정보 출력
//			4. 학생 정보 검색
//				- 이름으로 학생 정보 검색
//				- 검색한 이름에 대한 학생의 모든 정보 출력
//			5. 프로그램 종료
//		4. 예외 처리 사항
//			1. 입력된 정보가 없는 경우 알림 메시지
//			2. 정보를 저장할 공간이 없는 경우 알림 메시지
}
