package pmain;

public class J14_Quiz_HW_ArrayCla {

//	문제 : 학생 성적 관리 프로그램
//	- 다음 프로그램을 객체 배열을 이용하여 작성
	
//	1. 정보 갯수 : 3개
//	2. 정보 항목 :
//		- 이름, 학생 번호,
//			국어점수(1~3차)
//			영어점수(1~3차)
//			수학점수(1~3차)
//			총점(1~3차), 평균(1~3차, double), 등급(ABCDF, 1~3차)
//	3. 메뉴 항목 :
//		1. 학생 성적 정보 입력(Jop)
//		2. 학생 성적 정보 출력(Jop)
//		3. 학생 성적 정보 검색(이름 검색)
//		4. 프로그램 종료
	
//	4. 결과 화면
//		이름	번호	국어(1-2-3차)	영어(1-2-3차)	수학(1-2-3차)	총점(1-2-3차)	평균(1-2-3차)	등급(1-2-3차)
//		==================================================================================
//		둘리	1	89-34-12		34-65-76		45-76-54
}
